{"_id":{"$oid":"6254875b86f7bbad639fd448"},"Title":"The Martian","Description":"An astronaut becomes stranded on Mars after his team assume him dead and must rely on his ingenuity to find a way to signal to Earth that he is alive and can survive until a potential rescue.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream."},"Director":{"Name":"Ridley Scott","Bio":"Ridley Scott is an English film director and producer.","Birth":"1937"},"ImagePath":"themartian.png","Featured":true}
{"_id":{"$oid":"6254885786f7bbad639fd449"},"Title":"Inception","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the miind of a CEO, but his tragic past may doom the project and his team to disaster.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter.  His films have garnered 11 Academy Awards from 36 nominations.","Birth":"1970"},"ImagePath":"inception.png","Featured":false}
{"_id":{"$oid":"6254893c86f7bbad639fd44a"},"Title":"The Departed","Description":"An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Scorsese is an American film director, producer, and screenwriter.","Birth":"1942"},"ImagePath":"thedeparted.png","Featured":false}
{"_id":{"$oid":"62548a0286f7bbad639fd44b"},"Name":"Blood Diamond","Description":"A fisherman, a smuggler, and a syndicate of businessmen match wits over the possession of a priceless diamong.","Genre":{"Name":"Drama","Description":"Drama is a category of narrative fiction intended to be more serious than humorous in tone."},"Director":{"Name":"Edward Zwick","Bio":"Edward Zwick is an American filmmaker and producer of film and television.","Birth":"1952"},"ImagePath":"blooddiamond.png","Featured":false}
{"_id":{"$oid":"62548aea86f7bbad639fd44c"},"Name":"The Goonies","Description":"A group of young misfits called the Goonies discover an ancient map and set out on an adventure to find the long-lost treasure of a legendary pirate.","Genre":{"Name":"Adventure","Description":"Adventure films are exciting stories, with new experiences or exotic locales, and they are very similar to the actioin film genre, in that they are designed to provide an action-filled, energetic experience for the film viewer."},"Director":{"Name":"Richard Donner","Bio":"Richard Donner was an American filmmaker whose notable works included some of the most financially-successful films during the New Hollywood Era.","Birth":"1930","Death":"2021"},"ImagePath":"thegoonies.png","Featured":false}
{"_id":{"$oid":"62548b9586f7bbad639fd44d"},"Name":"The Shawshank Redemption","Description":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","Genre":{"Name":"Drama","Description":"Drama is a category of narrative fiction intended to be more serious than humorous in tone."},"Director":{"Name":"Frank Darabont","Bio":"Frank Darabont is an American film director, screenwriter, and producer.","Birth":"1959"},"ImagePath":"shawshankredemption.png","Featured":false}
{"_id":{"$oid":"62548c6286f7bbad639fd44e"},"Name":"The Dark Knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.","Genre":{"Name":"Action","Description":"The action movie genre includes films that have tremendous impact, continuous high energy, lots of physical stunts and activity, as well as other features that are all designed for pure audience escapism with the action sequences at the core of the film."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter.  His films have garnered 11 Academy Awards from 36 nominations.","Birth":"1970"},"ImagePath":"darkknight.png","Featured":false}
{"_id":{"$oid":"62548d0786f7bbad639fd44f"},"Name":"Saving Private Ryan","Description":"Following the Normandy Landings, a group of US soldiers go behind enemy lines to retrieve a paratrooper who is the last surviving brother of four that went to war.","Genre":{"Name":"Drama","Description":"Drama is a category of narrative fiction intended to be more serious than humorous in tone."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Spielberg is an American film director, producer, and screenwriter.","Birth":"1946"},"ImagePath":"savingprivateryan.png","Featured":false}
{"_id":{"$oid":"62548dbd86f7bbad639fd450"},"Name":"Interstellar","Description":"A team of explorers travel through a wormhole in space in an attempt to ensure the survival of humanity.","Genre":{"Name":"Science Fiction","Description":"Science fiction is a film genre that uses speculative, fictional science-based depictions of phenomena that are not fully accepted by mainstream."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is a British-American film director, producer, and screenwriter.  His films have garnered 11 Academy Awards from 36 nominations.","Birth":"1970"},"ImagePath":"interstellar.png","Featured":false}
{"_id":{"$oid":"62548eb186f7bbad639fd451"},"Name":"Snatch","Description":"Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Guy Ritchie","Bio":"Guy Ritchie is an English film director, producer, screenwriter, and businessman.","Birth":"1968"},"ImagePath":"snatch.png","Featured":false}
